{
    "web_page": {
        "description": "หน้าเว็บนี้สร้างขึ้นเพื่ออัพโหลดรูปภาพใบมะเขือเทศไปยังเซิร์ฟเวอร์ที่ใช้โมเดล API บน EC2 เพื่อทำการทำนายโรคของใบมะเขือเทศ",
        "functionality": [
            "หน้าเว็บมีปุ่มอัพโหลดรูปภาพ และปุ่มสำหรับถ่ายภาพใบมะเขือเทศ",
            "เมื่ออัพโหลดภาพไปยังเซิร์ฟเวอร์, รูปภาพจะถูกส่งไปยังโมเดลที่ฝึกฝนไว้ซึ่งทำงานบน EC2",
            "โมเดลจะทำการทำนายประเภทโรคที่อาจเกิดขึ้นกับใบมะเขือเทศและส่งผลลัพธ์กลับมายังผู้ใช้"
        ]
    },
    "model": {
        "description": "โมเดลที่ใช้ในโปรเจคนี้คือ AlexNet ซึ่งเป็นโครงสร้างของ Convolutional Neural Network (CNN)",
        "architecture": {
            "layer_1": {
                "type": "Conv2D",
                "filters": 96,
                "kernel_size": [11, 11],
                "strides": [4, 4],
                "padding": "valid",
                "activation": "relu",
                "pool_size": [3, 3],
                "strides_pool": [2, 2],
                "batch_normalization": true
            },
            "layer_2": {
                "type": "Conv2D",
                "filters": 256,
                "kernel_size": [5, 5],
                "strides": [1, 1],
                "padding": "same",
                "activation": "relu",
                "pool_size": [3, 3],
                "strides_pool": [2, 2],
                "batch_normalization": true
            },
            "layer_3": {
                "type": "Conv2D",
                "filters": 384,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "activation": "relu",
                "batch_normalization": true
            },
            "layer_4": {
                "type": "Conv2D",
                "filters": 384,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "activation": "relu",
                "batch_normalization": true
            },
            "layer_5": {
                "type": "Conv2D",
                "filters": 256,
                "kernel_size": [3, 3],
                "strides": [1, 1],
                "padding": "same",
                "activation": "relu",
                "pool_size": [3, 3],
                "strides_pool": [2, 2],
                "batch_normalization": true
            },
            "flatten": "Flatten the CNN output to feed it with fully connected layers",
            "dense_layers": [
                {
                    "units": 4096,
                    "activation": "relu",
                    "dropout": 0.5
                },
                {
                    "units": 4096,
                    "activation": "relu",
                    "dropout": 0.5
                }
            ],
            "output_layer": {
                "units": 4,
                "activation": "softmax"
            }
        },
        "compile_settings": {
            "optimizer": "Adam",
            "learning_rate": 0.001,
            "loss_function": "categorical_crossentropy",
            "metrics": [
                "accuracy",
                "top_k_categorical_accuracy"
            ]
        }
    },
    "general_care": {
        "description": "ใบปกติ",
        "general_care": [
            "มะเขือเทศต้องการการดูแลอย่างสม่ำเสมอเพื่อให้ได้ผลผลิตที่ดี โดยรวมถึงการตรวจสอบสภาพของใบทุกวันเพื่อตรวจสอบปัญหาที่อาจเกิดขึ้น เช่น โรคหรือแมลง",
            "ควรเลือกพันธุ์ที่ทนทานต่อโรค, ปฏิบัติตามหลักการปลูกที่ถูกต้อง, และรักษาความสะอาดของแปลงปลูก",
            "มะเขือเทศต้องการปุ๋ยที่มีธาตุอาหารครบถ้วน โดยเฉพาะปุ๋ยที่มีไนโตรเจน ฟอสฟอรัส และโพแทสเซียม ปุ๋ยควรให้ตามคำแนะนำของผู้ผลิตและตามลักษณะของดิน",
            "ควรรดน้ำมะเขือเทศอย่างสม่ำเสมอ โดยเฉพาะในช่วงที่ไม่มีฝน ควรรดน้ำให้เพียงพอเพื่อให้ดินมีความชื้นสม่ำเสมอ แต่ไม่ควรให้ดินเปียกมากเกินไป",
            "การตัดแต่งใบที่เสียหายหรือแห้งสามารถช่วยให้พืชมีการระบายอากาศที่ดีขึ้นและลดความเสี่ยงจากโรค"
        ]
    },
    "โรคใบจุดมะเขือเทศ": {
        "description": "โรคใบจุดมะเขือเทศมักมีลักษณะเป็นจุดสีน้ำตาลหรือดำที่มีขอบชัดเจนบนใบ และอาจมีวงแหวนสีเหลืองล้อมรอบจุด ในกรณีที่รุนแรง ใบอาจเหี่ยวและหลุดร่วง",
        "causes": "เกิดจากเชื้อรา Alternaria solani ซึ่งเจริญเติบโตในสภาพอากาศชื้นและอบอุ่น",
        "treatment": [
            "ใช้ยาฆ่าเชื้อรา เช่น Mancozeb หรือ Chlorothalonil",
            "ตัดใบที่เป็นโรคออกเพื่อลดการแพร่กระจายของเชื้อรา"
        ],
        "prevention": [
            "เลือกพันธุ์ที่ทนทาน",
            "รักษาความสะอาดในแปลงปลูก",
            "ปรับปรุงระบบระบายอากาศเพื่อหลีกเลี่ยงสภาพชื้น"
        ]
    },
    "โรคใบไหม้": {
        "description": "ใบที่เป็นโรคใบไหม้มีลักษณะเป็นแผลไหม้หรือจุดแห้งและสีคล้ำ โดยมักเกิดบริเวณขอบใบและอาจทำให้ใบหลุดร่วง",
        "causes": "ส่วนใหญ่เกิดจากการสัมผัสกับแสงแดดที่ร้อนจัดหรือการขาดธาตุอาหารบางชนิด เช่น โพแทสเซียม",
        "treatment": [
            "เพิ่มธาตุอาหารให้กับพืช โดยเฉพาะโพแทสเซียม",
            "ปรับสภาพแวดล้อม เช่น การเพิ่มร่มเงาหรือปรับระบบการให้น้ำ"
        ],
        "prevention": [
            "ใช้ปุ๋ยที่มีโพแทสเซียมสูง",
            "รักษาความชื้นในดิน",
            "หลีกเลี่ยงการสัมผัสกับแสงแดดที่ร้อนจัด"
        ]
    },
    "โรคใบจุดวงกลม": {
        "description": "ใบที่เป็นโรคใบจุดวงกลมมีจุดแผลที่มีลักษณะเป็นวงกลมสีดำหรือสีน้ำตาล โดยที่ศูนย์กลางของจุดมักจะมีสีขาวหรือเทา",
        "causes": "เชื้อราที่เป็นสาเหตุคือ Septoria lycopersici ซึ่งเจริญเติบโตในสภาพที่มีความชื้นสูงและอุณหภูมิพอเหมาะ",
        "treatment": [
            "ใช้ยาฆ่าเชื้อรา เช่น Thiophanate-methyl",
            "ตัดใบที่เป็นโรคออก"
        ],
        "prevention": [
            "ปลูกพันธุ์ที่ทนทาน",
            "รักษาความสะอาดของแปลงปลูก",
            "หลีกเลี่ยงการให้น้ำที่ทำให้ใบเปียก"
        ]
    }
}
